 [
    {
      "link":
        "https://www.reddit.com/r/Alzheimers/comments/evewsc/i_am_not_sure_what_to_do_with_my_dads_what_seems/incognito713/",
      "body":
        "All accounts would be off limits. He should not be responsible to pay for anything or give directions to any contractors. I would make that known to anyone doing work around the house. Your mom should make it clear, the only job getting paid for is the one that is requested from her.",
      "author": "incognito713"
    },
    {
      "link":
        "https://www.reddit.com/r/Alzheimers/comments/evewsc/i_am_not_sure_what_to_do_with_my_dads_what_seems/PegShop/",
      "body": "How old are you? If he can still work and hasn’t retired yet and your mom helps, you should be able to work for now anyway. Right?",
      "author": "PegShop"
    },
    {
      "link":
        "https://www.reddit.com/r/dementia/comments/er7mpz/the_double_hit_of_childhood_abuse_and_dementia/kidneypunch27",
      "body":
        "This is hard. My brother and I are finding out that we need each other so much more now that dad is slipping away. We had a really traumatic childhood, dad wasn’t around. We’re in 40-50 ranges now, mom died many years ago and dad misremembers “that’s not how I raised you. I am sorry. ",
      "author": "kidneypuch27"
    },
    {
      "link":
        "https://www.reddit.com/r/dementia/comments/er7mpz/the_double_hit_of_childhood_abuse_and_dementia/barefootgirl66/",
      "body": "I absolutely understand. My mother was abusive, blamed everything on her depression. Although my father treated me well he didnt protect me from my mother, never tried to intervene. They were diagnosed with dementia within 2 weeks of each other. His dementia is much worse and progressing much quicker than hers. Now I will have to take care of them for the rest of their lives.",
      "author": "barefootgirl66"
    },
    {
      "link":
        "https://www.reddit.com/r/dementia/comments/er7mpz/the_double_hit_of_childhood_abuse_and_dementia/batmansconcubine/",
      "body":
        "I totally understand what you're feeling. You want so badly to be validated instead of people telling you that the person can't help it. Like you don't know they have Dementia. It doesn't make it less PAINFUL.",
      "author": "batmansconcubine"
    },
    {
      "link":
        "https://www.reddit.com/r/dementia/comments/er7mpz/the_double_hit_of_childhood_abuse_and_dementia/Iamredditlady/",
      "body": "Ugh, the total re-writing of history.... That’s a really hard one for me to get past. That’s what it was like as a kid.",
      "author": "Iamredditlady"
    },
    {
      "link":
        "https://www.reddit.com/r/dementia/comments/ev02i5/mom_is_still_there/HoosierKittyMama/",
      "body": "My mom used to work with the elderly. When we had to put her in memory care she just went back into caregiver mode. She comforted the upset ones, tried to calm the angry, screaming ones. It broke my heart and made it difficult not to laugh when one day while I was sitting in the dining room with her",
      "author": "HossierKittyMama"
    },
    {
      "link":
        "https://www.reddit.com/r/dementia/comments/euy8ho/mom_in_er_psych_again/lilredwhale/",
      "body": "It took over three years for doctors to take us seriously and finally do some more extensive tests. It's horrible and hard but the best advice I can give is to keep pushing. And if you aren't getting any results from your doctors find new ones.",
      "author": "lilredwhale"
    },
    {
      "link":
        "https://www.reddit.com/r/dementia/comments/euy8ho/mom_in_er_psych_again/InAHundredYears",
      "body":
        "Inpatient psych care is more about keeping people from harming themselves (or others) than anything else. They take away your dignity, your freedom (even just to get some fresh air!) and force you to associate with strangers whose behavior can be terrifying; inpatients are vulnerable to theft, sexual assault, unsanitary conditions, inedible food, verbal abuse from other patients and staff.",
      "author": "InAHundredYears"
    },
    {
      "link":
        "https://www.reddit.com/r/dementia/comments/euy8ho/mom_in_er_psych_again/Piper1105",
      "body": "Nobody can do it full time when dementia is involved. It sounds to me like your mom needs a memory care unit. I feel for your sister. I imagine she is extremely stressed right now.",
      "author": "Piper1105"
    },
    {
      "link":
        "https://www.reddit.com/r/dementia/comments/eua4mm/have_anyone_noticed_dementia_people_looks/Dimeolas7",
      "body": "The outside can often reflect the inside. When I go in to check on him hes curled up in his chair and has this lost look on his face like hes deep in thought or dreaming and cant come back to reality yet. ",
      "author": "Dimeolas7"
    }
  ]